grevaillot/svd_tools/headers/STM32F7x/otg_fs_global.h
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_IDCHNG ID input pin changed **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_IDCHNG		(1 << 20)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_DBCDNE Debounce done **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_DBCDNE		(1 << 19)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_ADTOCHG A-device timeout change **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_ADTOCHG		(1 << 18)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_HNGDET Host negotiation detected **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_HNGDET		(1 << 17)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_HNSSCHG Host negotiation success status change **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_HNSSCHG		(1 << 9)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_SRSSCHG Session request success status change **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_SRSSCHG		(1 << 8)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT_SEDET Session end detected **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT_SEDET		(1 << 2)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_gahbcfg OTGFSGAHBCFG OTG_FS AHB configuration register (OTG_FS_GAHBCFG)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GAHBCFG_PTXFELVL Periodic TxFIFO empty level **/
#define OTG_FS_GLOBAL_OTG_FS_GAHBCFG_PTXFELVL		(1 << 8)
/** OTG_FS_GLOBAL_OTG_FS_GAHBCFG_TXFELVL TxFIFO empty level **/
#define OTG_FS_GLOBAL_OTG_FS_GAHBCFG_TXFELVL		(1 << 7)
/** OTG_FS_GLOBAL_OTG_FS_GAHBCFG_GINT Global interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GAHBCFG_GINT		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_gusbcfg OTGFSGUSBCFG OTG_FS USB configuration register (OTG_FS_GUSBCFG)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GUSBCFG_FDMOD Force device mode **/
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_FDMOD		(1 << 30)
/** OTG_FS_GLOBAL_OTG_FS_GUSBCFG_FHMOD Force host mode **/
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_FHMOD		(1 << 29)

#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_TRDT_SHIFT		10
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_TRDT_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_gusbcfg_trdt TRDT USB turnaround time
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GUSBCFG_HNPCAP HNP-capable **/
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_HNPCAP		(1 << 9)
/** OTG_FS_GLOBAL_OTG_FS_GUSBCFG_SRPCAP SRP-capable **/
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_SRPCAP		(1 << 8)
/** OTG_FS_GLOBAL_OTG_FS_GUSBCFG_PHYSEL Full Speed serial transceiver select **/
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_PHYSEL		(1 << 6)

#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_TOCAL_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG_TOCAL_MASK		0x07
/** @defgroup otg_fs_global_otg_fs_gusbcfg_tocal TOCAL FS timeout calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_grstctl OTGFSGRSTCTL OTG_FS reset register (OTG_FS_GRSTCTL)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL_AHBIDL AHB master idle **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_AHBIDL		(1 << 31)

#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_TXFNUM_SHIFT		6
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_TXFNUM_MASK		0x1f
/** @defgroup otg_fs_global_otg_fs_grstctl_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL_TXFFLSH TxFIFO flush **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_TXFFLSH		(1 << 5)
/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL_RXFFLSH RxFIFO flush **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_RXFFLSH		(1 << 4)
/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL_FCRST Host frame counter reset **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_FCRST		(1 << 2)
/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL_HSRST HCLK soft reset **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_HSRST		(1 << 1)
/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL_CSRST Core soft reset **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL_CSRST		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_gintsts OTGFSGINTSTS OTG_FS core interrupt register (OTG_FS_GINTSTS)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_WKUPINT Resume/remote wakeup detected interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_WKUPINT		(1 << 31)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_SRQINT Session request/new session detected interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_SRQINT		(1 << 30)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_DISCINT Disconnect detected interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_DISCINT		(1 << 29)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_CIDSCHG Connector ID status change **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_CIDSCHG		(1 << 28)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_PTXFE Periodic TxFIFO empty **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_PTXFE		(1 << 26)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_HCINT Host channels interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_HCINT		(1 << 25)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_HPRTINT Host port interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_HPRTINT		(1 << 24)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_RSTDET Reset detected interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_RSTDET		(1 << 23)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_IPXFR_INCOMPISOOUT Incomplete periodic transfer(Host mode)/Incomplete isochronous OUT transfer(Device mode) **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_IPXFR_INCOMPISOOUT		(1 << 21)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_IISOIXFR Incomplete isochronous IN transfer **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_IISOIXFR		(1 << 20)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_OEPINT OUT endpoint interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_OEPINT		(1 << 19)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_IEPINT IN endpoint interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_IEPINT		(1 << 18)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_EOPF End of periodic frame interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_EOPF		(1 << 15)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_ISOODRP Isochronous OUT packet dropped interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_ISOODRP		(1 << 14)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_ENUMDNE Enumeration done **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_ENUMDNE		(1 << 13)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_USBRST USB reset **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_USBRST		(1 << 12)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_USBSUSP USB suspend **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_USBSUSP		(1 << 11)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_ESUSP Early suspend **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_ESUSP		(1 << 10)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_GOUTNAKEFF Global OUT NAK effective **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_GOUTNAKEFF		(1 << 7)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_GINAKEFF Global IN non-periodic NAK effective **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_GINAKEFF		(1 << 6)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_NPTXFE Non-periodic TxFIFO empty **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_NPTXFE		(1 << 5)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_RXFLVL RxFIFO non-empty **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_RXFLVL		(1 << 4)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_SOF Start of frame **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_SOF		(1 << 3)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_OTGINT OTG interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_OTGINT		(1 << 2)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_MMIS Mode mismatch interrupt **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_MMIS		(1 << 1)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS_CMOD Current mode of operation **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS_CMOD		(1 << 0)

/**@}*/

