grevaillot/svd_tools/headers/STM32F7x/otg_fs_global.h
/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_SNDLPM Send LPM transaction **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_SNDLPM		(1 << 24)

#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRCNT_SHIFT		21
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRCNT_MASK		0x07
/** @defgroup otg_fs_global_otg_fs_glpmcfg_lpmrcnt LPMRCNT LPM retry count
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMCHIDX_SHIFT		17
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMCHIDX_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_glpmcfg_lpmchidx LPMCHIDX LPM Channel Index
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1RSMOK Sleep State Resume OK **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1RSMOK		(1 << 16)
/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_SLPSTS Port sleep status **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_SLPSTS		(1 << 15)

#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRST_SHIFT		13
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRST_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_glpmcfg_lpmrst LPMRST LPM response
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1DSEN L1 deep sleep enable **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1DSEN		(1 << 12)

#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_BESLTHRS_SHIFT		8
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_BESLTHRS_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_glpmcfg_beslthrs BESLTHRS BESL threshold
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1SSEN L1 Shallow Sleep enable **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1SSEN		(1 << 7)
/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_REMWAKE bRemoteWake value **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_REMWAKE		(1 << 6)

#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_BESL_SHIFT		2
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_BESL_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_glpmcfg_besl BESL Best effort service latency
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMACK LPM token acknowledge enable **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMACK		(1 << 1)
/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMEN LPM support enable **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMEN		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_gpwrdn OTGFSGPWRDN OTG power down register
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GPWRDN_ADPIF ADP interrupt flag **/
#define OTG_FS_GLOBAL_OTG_FS_GPWRDN_ADPIF		(1 << 23)
/** OTG_FS_GLOBAL_OTG_FS_GPWRDN_ADPMEN ADP module enable **/
#define OTG_FS_GLOBAL_OTG_FS_GPWRDN_ADPMEN		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_gadpctl OTGFSGADPCTL OTG ADP timer, control and status register
@{*/


#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_AR_SHIFT		27
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_AR_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_gadpctl_ar AR Access request
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPTOIM ADP timeout interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPTOIM		(1 << 26)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPSNSIM ADP sense interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPSNSIM		(1 << 25)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPPRBIM ADP probe interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPPRBIM		(1 << 24)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPTOIF ADP timeout interrupt flag **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPTOIF		(1 << 23)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPSNSIF ADP sense interrupt flag **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPSNSIF		(1 << 22)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPPRBIF ADP probe interrupt flag **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPPRBIF		(1 << 21)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPEN ADP enable **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPEN		(1 << 20)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPRST ADP reset **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPRST		(1 << 19)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ENASNS Enable sense **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ENASNS		(1 << 18)
/** OTG_FS_GLOBAL_OTG_FS_GADPCTL_ENAPRB Enable probe **/
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_ENAPRB		(1 << 17)

#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_RTIM_SHIFT		6
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_RTIM_MASK		0x7ff
/** @defgroup otg_fs_global_otg_fs_gadpctl_rtim RTIM Ramp time
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBPER_SHIFT		4
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBPER_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_gadpctl_prbper PRBPER Probe period
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBDELTA_SHIFT		2
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBDELTA_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_gadpctl_prbdelta PRBDELTA Probe delta
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBDSCHG_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBDSCHG_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_gadpctl_prbdschg PRBDSCHG Probe discharge
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_hptxfsiz OTGFSHPTXFSIZ OTG_FS Host periodic transmit FIFO size register (OTG_FS_HPTXFSIZ)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ_PTXFSIZ_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ_PTXFSIZ_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_hptxfsiz_ptxfsiz PTXFSIZ Host periodic TxFIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ_PTXSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ_PTXSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_hptxfsiz_ptxsa PTXSA Host periodic TxFIFO start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_dieptxf1 OTGFSDIEPTXF1 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF1)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF1_INEPTXFD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF1_INEPTXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf1_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF1_INEPTXSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF1_INEPTXSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf1_ineptxsa INEPTXSA IN endpoint FIFO2 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_dieptxf2 OTGFSDIEPTXF2 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF2)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF2_INEPTXFD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF2_INEPTXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf2_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF2_INEPTXSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF2_INEPTXSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf2_ineptxsa INEPTXSA IN endpoint FIFO3 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_dieptxf3 OTGFSDIEPTXF3 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF3)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF3_INEPTXFD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF3_INEPTXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf3_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF3_INEPTXSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF3_INEPTXSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf3_ineptxsa INEPTXSA IN endpoint FIFO4 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_dieptxf4 OTGFSDIEPTXF4 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF4)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF4_INEPTXFD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF4_INEPTXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf4_ineptxfd INEPTXFD IN endpoint Tx FIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF4_INEPTXSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF4_INEPTXSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf4_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_dieptxf5 OTGFSDIEPTXF5 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF5)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF5_INEPTXFD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF5_INEPTXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf5_ineptxfd INEPTXFD IN endpoint Tx FIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF5_INEPTXSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF5_INEPTXSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf5_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/
